app/controllers/task_controller.rb

	def new
		@user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]

	def create
		@user = User.find(session[:user_id])
		@task = @user.tasks.new(task_params)
		if @task.save
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "tasks" ("created_at", "description", "is_complete", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-10-28 00:52:50.935408"], ["description", "this is a test"], ["is_complete", "t"], ["updated_at", "2014-10-28 00:52:50.935408"], ["user_id", 1]]

	def show
		#@user = User.find(session[:user_id])
		@task = Task.find(params[:id])
---
SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = $1 LIMIT 1  [["id", 1]]

	def edit
		@user = User.find(session[:user_id])
		@task = Task.find(params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = $1 LIMIT 1  [["id", 1]]

	def update
		@user = User.find(params[:user_id])
		@task = Task.find(params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = $1 LIMIT 1  [["id", 1]]