app/controllers/user_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
---
	def index
		if session[:user_id] != nil
			redirect_to user_path(User.find(session[:user_id]))

INSERT INTO "users" ("created_at", "email", "password_digest", "phone", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
	def create
		@user = User.new(user_params)


		if @user.save

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "tasks".* FROM "tasks"  WHERE "tasks"."user_id" = 2
---
	def show
		@user = User.find(session[:user_id])
		@tasks = Task.where(:user_id => session[:user_id])